novaeco/Projet-Assistant--Reptiles/sdkconfig.defaults
# ESP32-S3 Specific
CONFIG_IDF_TARGET="esp32s3"

# Flash Size (16MB Required for dual ~4MB OTA slots + 8MB Storage)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# PSRAM (Required for RGB Panel & LVGL)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_32B=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# LVGL Configuration (v9.4)
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_OS_FREERTOS=y

# Board calibration (battery ADC scaling)
CONFIG_BOARD_BATTERY_RAW_FULL=255
CONFIG_BOARD_BATTERY_RAW_EMPTY=0
CONFIG_BOARD_SD_HOLD_CS_LOW_DIAG=n
CONFIG_BOARD_ENABLE_SD=n
CONFIG_BOARD_I2C_PORT=0
CONFIG_BOARD_I2C_SDA=8
CONFIG_BOARD_I2C_SCL=9
CONFIG_BOARD_IOEXP_DRIVER_WAVESHARE=y
CONFIG_BOARD_IOEXP_ALLOW_CH422G_FALLBACK=y
CONFIG_BOARD_BATTERY_ENABLE=n
CONFIG_BOARD_BACKLIGHT_MAX_DUTY=5000
CONFIG_BOARD_BACKLIGHT_ACTIVE_LOW=n
CONFIG_BOARD_BACKLIGHT_RAMP_TEST=n
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y

# Display
# Increase main task stack size for initialization
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_BOARD_LCD_PCLK_HZ=51200000
CONFIG_BOARD_LCD_POL_PCLK_ACTIVE_NEG=n
CONFIG_BOARD_LCD_POL_HSYNC_IDLE_LOW=n
CONFIG_BOARD_LCD_POL_VSYNC_IDLE_LOW=n
CONFIG_BOARD_LCD_POL_DE_IDLE_HIGH=n
CONFIG_BOARD_LCD_PSRAM_TRANS_ALIGN=64
CONFIG_BOARD_LCD_BOUNCE_LINES=8
CONFIG_BOARD_LCD_DEBUG_PATTERN_AT_BOOT=n
CONFIG_BOARD_LCD_SELFTEST_PATTERN=n
CONFIG_BOARD_LCD_BYPASS_LVGL_SELFTEST=n
CONFIG_BOARD_LCD_TEST_PATTERN=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=1024

# FATFS
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
